/*Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.

3 -> 1, 8, 27
5 -> 1, 8, 27, 64, 125*/


Console.Write("Input number");
int number=Convert.ToInt32(Console.ReadLine());
int cube = Convert.ToInt32(Console.ReadLine());
int size =0;
if (number >= size);
{
   while (cube[0]== number*number*number);
    size++;
}
Застряла  здесь.не понимаю, какие значения нужно присвоить,чтобы заработало.